/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (és még %2$d)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "A(z) „%1$@” kibontása nem sikerült a(z) „%2$@” archívumból: %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "A(z) „%1$@” erőforráságának kibontása nem sikerült a(z) „%2$@” archívumból:\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Alapértelmezett kódolás";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Automatikus észlelés";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Kibontás";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Archívum kibontása";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "„%@” kibontása";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "„%@” kibontásának előkészítése";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Kiválaszt";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Válaszd ki a kibontandó fájlokat";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "A The Unarchiver nem tudja kibontani a(z) „%@” tartalmát.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "A(z) „%1$@” tartalmának kibontásakor hiba történt: %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "A(z) „%1$@” tartalmának beolvasásakor hiba történt: %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Kibontás";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "A(z) „%@” megnyitásához add meg az archívum jelszavát.";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Hova bontsa ki a The Unarchiver az archívumokat?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Mindig ugyanabba a mappába, vagy szeretnéd minden alkalommal kiválasztani a kibontás helyét?";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Kérdezze meg minden alkalommal";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Kibontás ugyanabba a mappába";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "A The Unarchiver engedélyt kér, hogy a kibontott fájlokat elmenthesse a megadott mappába. A művelet jóváhagyásához kattints a „Kibontás” lehetőségre.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "A The Unarchiver engedélyt kér, hogy megkeresse a kiválasztott archívum többi részét a megadott helyen. A művelet jóváhagyásához kattints a „Keresés” lehetőségre.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Keresés";

/* Check for updates menu item */
"Check for Updates…" = "Frissítések keresése…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Az archívum hiányos";
"Opening file failed" = "A fájl nem nyitható meg";
"Missing or wrong password" = "Helytelen jelszó";
"Wrong checksum" = "Az archívum sérült";
"Could not create directory" = "A mappa létrehozása sikertelen";

/* Uncommon or unused errors */
"Unknown error" = "Ismeretlen hiba";
"Failed to write to file" = "A fájl írása sikertelen";
"Function called with illegal parameters" = "Érvénytelen függvényparaméterek";
"Not enough memory available" = "Nincs elég memória";
"Data is corrupted" = "Az adatok sérültek";
"File is not fully supported" = "A fájl nem teljesen támogatott";
"Required resource missing" = "Egy szükséges erőforrás hiányzik";
"Error on decrunching" = "Kitömörítési hiba";
"Unknown file type" = "Ismeretlen fájltípus";
"File, disk has been skipped" = "Fájl vagy lemez kihagyva";
"User cancelled extraction" = "A felhasználó megszakította a kibontást";
"File already exists" = "A fájl már létezik";
"Verify failed (disk hook)" = "Az ellenőrzés sikertelen";
"Wrong drive geometry" = "Hibás a meghajtó geometriája";
"Unknown data format" = "Ismeretlen adatformátum";
"Source contains no files" = "A forrás nem tartalmaz fájlokat";
"Unknown filesystem" = "Ismeretlen fájlrendszer";
"Name of file exists as directory" = "Ezen a fájlnéven már létezik egy könyvtár";
"Buffer was too short" = "A puffer túl rövid";
"Text encoding was defective" = "A szöveg kódolása hibás";
"Could not create symlink" = "Szimlink létrehozása sikertelen";

"AlertTitle_SetFileTypeAssociationAppStore" = "Érdemes lehet beállítani a The Unarchiver appot alapértelmezettként a kiválasztott fájltípusokhoz.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Kattints jobb gombbal egy fájlra, és válaszd az „Infó megjelenítése” lehetőséget, majd a „Megnyitás ezzel:” alatt válaszd ki a The Unarchiver appot. Kattints az „Összes módosítása…” lehetőségre; ezzel minden hasonló archívumra alkalmazod a beállítást.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "Ha szeretnéd, másik appot is beállíthatsz alapértelmezettként a kiválasztott fájltípusokhoz.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Kattints jobb gombbal egy fájlra, és válaszd az „Infó megjelenítése” lehetőséget, majd a „Megnyitás ezzel:” alatt válaszd ki a kívánt appot. Kattints az „Összes módosítása…” lehetőségre; ezzel minden hasonló archívumra alkalmazod a beállítást.";

/* About window */
"Standalone" = "Különálló";

/* Extracted view */
"extracted" = "kibontva";
